fep-jmeter-plugin/examples/FISC_Parameterized_Test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="FISC 參數化測試計畫" enabled="true">
      <stringProp name="TestPlan.comments">使用 CSV 資料檔案進行參數化測試</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="FISC_HOST" elementType="Argument">
            <stringProp name="Argument.name">FISC_HOST</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="FISC_PORT" elementType="Argument">
            <stringProp name="Argument.name">FISC_PORT</stringProp>
            <stringProp name="Argument.value">9000</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="INSTITUTION_ID" elementType="Argument">
            <stringProp name="Argument.name">INSTITUTION_ID</stringProp>
            <stringProp name="Argument.value">012</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <!-- ========================================== -->
      <!-- Thread Group: 參數化提款測試 -->
      <!-- ========================================== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="參數化提款測試" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">2</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <!-- CSV 資料設定 -->
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV 測試卡資料" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="fileEncoding">UTF-8</stringProp>
          <stringProp name="filename">test_cards.csv</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="variableNames">pan,amount,terminalId,description</stringProp>
        </CSVDataSet>
        <hashTree/>

        <!-- 提款交易 -->
        <com.fep.jmeter.sampler.FiscSampler guiclass="TestBeanGUI" testclass="com.fep.jmeter.sampler.FiscSampler" testname="跨行提款 - ${description}" enabled="true">
          <stringProp name="host">${FISC_HOST}</stringProp>
          <intProp name="port">9000</intProp>
          <intProp name="connectionTimeout">10000</intProp>
          <intProp name="readTimeout">30000</intProp>
          <stringProp name="transactionType">WITHDRAWAL</stringProp>
          <stringProp name="institutionId">${INSTITUTION_ID}</stringProp>
          <stringProp name="terminalId">${terminalId}</stringProp>
          <stringProp name="pan">${pan}</stringProp>
          <stringProp name="processingCode">010000</stringProp>
          <stringProp name="amount">${amount}</stringProp>
        </com.fep.jmeter.sampler.FiscSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="驗證回應碼" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">00</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">提款失敗: ${description}</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="記錄交易結果" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">def responseCode = vars.get("FISC_RESPONSE_CODE")
def stan = vars.get("FISC_STAN")
def rrn = vars.get("FISC_RRN")
def pan = vars.get("pan")
def amount = vars.get("amount")
def desc = vars.get("description")

log.info("交易完成: ${desc}")
log.info("  PAN: ${pan}, 金額: ${amount}")
log.info("  STAN: ${stan}, RRN: ${rrn}, 回應碼: ${responseCode}")</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PostProcessor>
          <hashTree/>
        </hashTree>
      </hashTree>

      <!-- ========================================== -->
      <!-- 監聽器 -->
      <!-- ========================================== -->
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="檢視結果樹" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="彙總報告" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>

    </hashTree>
  </hashTree>
</jmeterTestPlan>